export default function Privacy() {
  return (
    <div className="my-32 text-center w-96 border border-grey-300 rounded-xl p-4 mx-auto">
      <div className="text-xl font-bold py-2">
      מדיניות פרטיות – Susy Academy
      </div>


אנו ב-Susy Academy מכבדים את פרטיותכם. הפרטים האישיים שתמסרו לנו (כגון שם, מספר טלפון, כתובת דואל או תחומי עניין) ישמשו אך ורק ליצירת קשר ולמתן מידע מקצועי על הקורסים שלנו, כולל המכינה ללימודי רפואה באיטליה.
<br></br>
אנו מתחייבים לשמור את פרטיכם בצורה מאובטחת ולא להעביר אותם לגורמים שלישיים ללא אישור מפורש מצדכם.
<br></br>
בכל עת תוכלו לפנות אלינו בבקשה לעדכון, תיקון או מחיקת המידע שלכם על ידי יצירת קשר דרך האתר או בדרכי ההתקשרות המופיעות באתר.
<br></br>
Susy Academy שומרת לעצמה את הזכות לעדכן מדיניות פרטיות זו מעת לעת, והשינויים יעודכנו כאן.
<br></br><br></br>
תודה שבחרתם בנו,<br></br>
צוות Susy Academy
    </div>

  )
}
