import Image from "next/image";

const reviews = [{
    "review": "אני יותר משמחה וגאה להמליץ על סוזי ועל המכינה שלה. אני כרגע לומדת רפואה שנה א' ב'לה ספיאנצה' ברומא והדרך לא הייתה קלה אבל האמנתי שאכנס, לא כי אני האמנתי או הייתי בטוחה בעצמי כל הזמן, אלא כי סוזי האמינה בי. היא לימדה אותי את כל בסיס הרפואה בשפה זרה לחלוטין, והיא לימדה אותי חומרים שלא היה לי בסיס אליהם בהתחלה אבל בכל זאת הצלחתי. היא הייתה שם איתי ולצידי בכל שלב בדרך מהרגע הראשון ואפילו עד עכשיו! זו אישה עם ניסיון רחב בשפה האיטלקית וידע אדיר. לב רחב ורצון אמיתי לסייע לכל אחד ואחת מהסטודנטים שלה להגשים את החלום שלו, וזה אומר שהיא משקיעה ומאמינה בסטודנטים שלה- בכל אחד, את כל מה שהיא יכולה. אני יכולה להבטיח עם יד על הלב שעם השקעה, התמדה וחריצות מהצד שלכם (כי אין מה לעשות, צריך), סוזי תרים את הידע השפתי והמדעי שלכם לרמה אחרת ותתן לכם צ'אנס אמיתי להתקבל ללימודים שאתם רוצים.  אני קוראת לה 'אמא של הסטודנטים' אני מאמינה שחבריי למכינה יסכימו איתי. תודה סוזי, ובהצלחה לכולם!",
    "from": "טליה וייץ",
    "image": "/images/reviewers/talya.jpg"
}, {
    "review": "אני איתן, סטודנט שנה שלישית לרפואת שיניים בפאביה. התחלתי את המסע בלמידה עצמאית למבחן האיימט אך לא הצלחתי להיכנס לרשימה😢. אחרי שהתאפסתי על עצמי מהבאסה, החלטתי לברר על המסלול באיטלקית ונתקלתי במכינה של סוזי והחלטתי ללכת על זה😎 התוכן הלימודי היה מספיק בהחלט! השיעורים והמצגות היו לעניין ובאיכות גבוהה, תרגלנו המון סימולציות וקיבלנו הכוונה וליווי יד ביד שגרמו למבחני כניסה להיות הרבה פחות מפחידים (לעומת האיימט השחור שהיה לי😅).אסכם בזה שסוזי אישה מדהימה וחגורה שחורה בלהכין סטודנטים ללימודים 💜💯🔝🔥🥋ממליץ בחום למי שמחפש קורס הכנה איכותי ומשפחתי ולא חארטה שיווקית🔥בהצלחה לכולם ונתראה באיטליה",
    "from": "איתן ברלב",
    "image": "/images/reviewers/eitanbarlev.jpg"
}, {
    "review": "בשנה שעברה גם אני למדתי אצל סוזי והתכוננתי למבחן האמיסיונה, המכינה הייתה מקיפה, מעמיקה ומותאמת למבחן הכניסה בדיוק. גם כשסוזי הייתה בהריון מתקדם תמיד הייתה זמינה לנו, וזכינו למלא יחס אישי וליווי לאורך כל הדרך. בקיצור סוזי את וונדר וומן של ממש!!🥹❤️סוזי ללא ספק זכיתי שהיית המורה שלי! ממליצה בחום!",
    "from": "שריי שדה",
    "image": "/images/reviewers/saraisade.jpg"
}, {
    "review": "היה זה לפני מעט יותר משנה שהתקשרתי לסוזי עם חלום לא נפוץ במיוחד: ״אני רוצה ללמוד פזיותרפיה באיטליה״ אמרתי לה. ״אמנם אני לא מכירה סטודנטים שלומדים שם פזיותרפיה, אבל לא תהיה שום בעיה!!״ ככה היא אמרה לי. ומבחינתי השיחה הזאת הספיקה כדי שאחליט שסוזי תכין אותי לקראת המסע של הלימודים באיטליה.סוזי היא לא רק מורה בחסד עליון: מוכשרת, מקצוענית, משקיענית וקפדנית. אבל זה לא הכל. היא לפני הכל אדם רגיש, אכפתי ודואג. מלווה יד ביד בתהליך מרגש ורווי בהמון סימני שאלה. היא דאגה תמיד לייצר עבורנו ודאות ולתמוך בחיוך ואופטימיות שמאפיינת אותה. עשתה עבורנו מעל והרבה מעבר למה שאפשר לצפות ואני אגלה לכם סוד - עד היום היא זמינה עבורי לתקן מכתבים לפרופסורים!!בהצלחה לכל החברים החדשים בקהילת Mechina con Susy, מחכים לכם באיטליה",
    "from": "שי קיפרווסר",
    "image": "/images/reviewers/shaykiper.jpg"
}, {
    "review": "אני אישית מאוד הייתי נעולה מאוד על לימודי רפואה וניסיתי למצוא את הדרך הכי מהירה להגיע ליעד הזה. לצערי הרב הדרך לא הייתה פשוטה . ניגשתי למבחן הIMAT ולא התקבלתי. זאת הייתה שנה מאתגרת במילים מועטות. למזלי הרב הכרתי את סוזי והיא ליוותה אותי יד ביד מתחילת המסע שלי בזמנו עוד שניסיתי ללמוד עצמאית לIMAT ועד היום שהתקבלתי ללימודי הרפואה . קשה לי לסכם במילים את כמות הסבלנות,הנתינה והאיכפתיות שזכיתי לקבל ממנה:שיחות ארוכות על הבירוקרטיה האיטלקית, שיחות מוטיבציה , שיעורים פרטיים לחזוק ועוד אינספור דברים .. סוזי פשוט יודעת לתת מענה ועושה את זה מכל הלב. מאחלת לכם שתהיה  לכם מורה כמו סוזי!",
    "from": "עדן ברנשטיין",
    "image": "/images/reviewers/edenbern.jpg"
}, {
    "review": "סוזי ליוותה אותי במשך שנה שלמה, חצי שנה בלימוד השפה האיטלקית והכנה למבחן השפה וחצי שנה נוספת ללימוד המקצועות והכנה למבחן האמיסיונה. סוזי מורה מנוסה מאוד, לימדה בעבר גם במכון לתרבות איטלקית ויודעת להעביר את השיעורים בצורה חווייתית ומעניינת, ומעל הכל זמינה כמעט בכל זמן אפשרי מעבר לזמן הקצוב של השיעורים, ולא פחות חשוב מזה, היא מלווה בכל שלב ושלב בבירוקרטיה האיטלקית הקשוחה ודואגת תמיד לתזכר ולעזור בכל מה שניתן מבחינתה🙏🏼 ואפילו אחרי שהסתיים הקורס- עמדה לרשותינו בהרשמה הסופית ואני יכול להגיד בפה מלא שהיא הרבה מעבר למורה עבורי, וניכר שהיא נותנת לתלמידים שלה את הלב והנשמה. אני זכיתי ללמוד אצלה ואני מקנא במי שעוד יבחר בה.",
    "from": "עדן שיטרית",
    "image": "/images/reviewers/edenshit.jpg"
}, {
    "review": "אשמח להמליץ בחום על סוזי, נכנסתי השנה ללימודים ברומא - מאוד נהנתי בקורס, השיעורים מועברים בצורה טובה, למדנו נקודות מאוד ספציפיות שהיו במבחן בסופו של דבר מבלי לטחון חומר סתם - מאוד מעשי, ניכר מאוד הוותק במקצוע והמקצועיות. אין מה לדבר בכלל על היחס האישי והחם - סוזי תמכה וסייעה בכל דבר גם לאחר שעות הלמידה, לפני קורס קודם כל אישיות מדהימה. הגעתי לקורס אחרי שלא עברתי את האיימט, מעט ביטחון והרבה אכזבה מבחינת הלימודים בחול - בסופו של דבר אני שמח שהמליצו לי על סוזי ושזכיתי להיות מבין תלמידיה",
    "from": "מור לוי",
    "image": "/images/reviewers/morlevi.jpg"
}, {
    "review": "המכינה של סוזי  אז לפני הכל בראש ובראשונה עוד לפני שהיא מורה מצויינת  סוזי היא פשוט אישה מדהימה  אמיתית, כנה, באה נטו לטובת הסטודנטים. דיברתי עם שלל מכינות בארץ ובאיטליה ומכולם קיבלתי את אותו הרושם- מוכרים לי קופסא יפה אך ריקה מתוכן.  ואז כשכבר כמעט התייאשתי, דיברתי עם סטודנט עבר של סוזי ועוד כמה נוספים.  מהשיחה הראשונה עם סוזי כבר אפשר להרגיש, כמה היא שונה מכולם היא לא מחפשת ליצור קבוצה גדולה ולעשות פרובקציה.  אצלה הסטודנטים זה משפחה היא מלמדת באופן אישי, כל סטודנט, כיתה אחת קטנה ומגובשת.  הטכניקות למידה שלה מדגישות את המקצועיות שלה ואת הניסיון שלה בתחום.  היא מלווה כל סטודנט גם בפאן האישי וגם בפאן המקצועי ולא נותנת לאף אחד להרגיש מאחור.  בסבלנות רבה, לימדה אותנו את השפה מאפס, מקצועות שלא חשבתי שאבין אף פעם הועברו בצורה כזו מדויקת וכיפית. סוזי ייעצה לי הרבה גם בחיים האישיים והרגשתי שיש לי עוד אמא, שאני יכולה לסמוך עלייה, שתעזור לי במה שטוב בשבילי  תמיד האמינה בי ותמיד תמכה בי  אם את/ה מחפש/ת ללמוד באמת עם כל התמיכה, זה המקום בשבילך♥ ",
    "from": "חן לובן",
    "image": "/images/reviewers/henluban.jpg"
}, {
    "review": "ממליצה בחום על סוזי! מורה מקצועית, מנוסה, משקיענית ואכפתית. שנותנת לא רק מנסיונה, אלא גם מהלב והנשמה, בשביל כל אחד מהסטודנטים שלומדים אצלה.  מרוצה מהאופן שבו עזרה לי להתכונן למבחני הקבלה לרפואה ובכלל ללמודים באוניברסיטה בשפה האיטלקית. תודה סוזי!❤",
    "from": "הגר קצמן",
    "image": "/images/reviewers/hagarkatzman.jpg"
}, {
    "review": "היי, מי שמתלבט לגבי לימודי רפואה באיטליה, ממליצה לכם בעיניים עצומות על המכינה של סוזי, עשיתי איתה מכינת השפה והקורס למבחן קבלה שנה שעברה והתקבלתי בין הראשונים באוניברסטת לה סאפיינצה רומא, אני לומדת באיטלקית וכבר בסמסטר השני שלי, ועדיין בקשר טוב עם סוזי כי היא בן אדם מדהים ונדיב ומקצועני ברמות, הרבה פעמים אני עדיין חוזרת על הסיכומים שלי ונעזרת בהם מרוב שהם היו ברמה גבוהה וטובה.  המורה איטלקיה במקור עם וותק של המון שנים ומקצוענית ברמות. הקורס זרם בצורה חלקה, התקמדנו יפה בחומר והיא תמיד היתה שם כדי להשלים פערים ולחזק לנו את החומר התיאורטי על ידי תרגול ושאלות. ממליצה בחום רב, היה לי ניסיון עם מכינות אחרות, אז אני יודעת להשוות טוב, והבנתי באמת כמה שהמכינה הזו מקצוענית ועל רמה, וסוזי כבן אדם היא בכלל מדהימה וכמו אמא❤ לכל ספק, שאלה, בירור או  סתם לשוחח עם סטודנטים לרפואה, מוזמנים לפנות אליי בכיף, בהצלחה לכולם! ❤",
    "from": "ליאן עובייד",
    "image": "/images/reviewers/lianovaied.jpg"
}]

const gradiants = ["from-indigo-500 to-emerald-500", "bg-gradient-to-r from-amber-500 to-pink-500", "bg-gradient-to-r from-pink-400 to-blue-400"];

export default function Reviews() {
    return (
        <div className="direction-rtl mt-32" id="reviews">
            <div className="rounded-3xl rounded-xl pb-6 xl:py-6 mx-auto w-11/12 xl:w-1/2">
                <div className="text-right text-3xl font-bold px-4 pb-4">
                    סטודנטים מספרים
                </div>
                <div className='items-center text-right '>
                    {
                        reviews.map((r, i) =>
                            <div className={`bg-gradient-to-r ${gradiants[i % 3]} rounded-xl my-4 p-2`} key={i}>
                                <div className="border rounded-lg px-4 py-8 bg-white" >
                                    <div className={`bg-gradient-to-r ${gradiants[i % 3]} w-[172px] h-[172px] flex justify-center items-center rounded-full mx-auto`}>
                                        <Image src={r.image} alt="" width={100} height={100} className="rounded-full w-[160px] h-[160px] border border-white border-4 object-cover" />
                                    </div>
                                    <div>
                                        <div className="font-bold text-xl text-center py-4">{r.from}</div>
                                        <div className="text-center">{r.review}</div>
                                    </div>

                                </div>
                            </div>
                        )
                    }
                </div>
            </div>
        </div>

    )
}